package polymo;

abstract public class AbstractClass {
	
	public void output() { // 클래스가 추상이라고 객체까지 추상일 필요는 없다 
							// 대신 추상클래스는 부모클래스여야 함 
		
//		실체클래스는 실체가 드러나는 클래스...
//		추상클래스는 실체 클래스의 공통적인 부분을 추출해 어느정도 규격을 잡아놓은 추상적인 클래스이다. 
//		그래서 실체클래스 실제 객체를 생성할 정도의 구체성을 가지는 반면, 
//		추상클래스는 아직 메서드와 내용이 추상적이기 때문에 객체를 생성할 수 없게 만들었다.
	
//		추상클래스를 상속 받을 때만 @Override를 쓸 수 있는 것이 아니라, 상속을 받을 경우에는 언제든 Overriding이 가능합니다.
//		class내에서 정의한 method도 재정의 할 수 있는데, 이는 Overloading이라고 합니다.
		
		
		
	}

}

